cf/Documents/ИзменениеКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ИзменениеКонфигурации</Name>
			<BasedOn>
				<xr:Item>Document.Обращение</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИзмененияКонфигурации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СутьИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовышенныйРиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрБазыДляТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначСписокБаз</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Обращение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияИзмененийКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛюбаяБазаДляТестирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыеОбъекты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
						<v8:Type>cfg:CatalogRef.Функции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРелиза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипРелиза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысокаяТрудоёмкостьОтката</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЭлемента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭлементовСтруктурыОбъектаМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементСтруктуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыСтруктурыОбъектаМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйОбъектМетаданных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалениеМетаданных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Релиз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазыТестирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
								<v8:Type>cfg:CatalogRef.Функции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/InformationRegisters/ИзмененияКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияКонфигурации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Обращение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияИзмененийКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойРелиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПовышенныйРиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/КатегорииОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>КатегорииОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВнешнихОтчётовИОбработок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонфигурации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонфигурацииБезПодтвержденияОдобрения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/ИзменениеКонфигурации/Ext/ObjectModule.bsl
&НаСервере
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (ДокументОснование.Категория = Перечисления.КатегорииОбращений.ИзменениеКонфигурации ИЛИ ДокументОснование.Категория = Перечисления.КатегорииОбращений.ИзменениеКонфигурацииБезПодтвержденияОдобрения) Тогда
		Сообщить("Для создания изменения конфигурации категория обращения должна быть ""Бизнес системы -> ERP -> 1C -> Изменение конфигурации""");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(ИмяФайлаПоставки) Тогда
			Сообщить("Данные изменения зафиксированы в файле поставки "+СокрЛП(ИмяФайлаПоставки));
			Если НЕ(РольДоступна("ПолныеПрава")) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании()
	
	ТЗ = Изменения.Выгрузить();
	ТЗ.ЗаполнитьЗначения(Справочники.Релизы.ПустаяСсылка(),"Релиз");
	ТЗ.ЗаполнитьЗначения("","Версия");
	Изменения.Загрузить(ТЗ);
	Релиз = Справочники.Релизы.ПустаяСсылка();
	Состояние = Неопределено;
	ИмяФайлаПоставки = "";
	КомментарийХранилища = "";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Заказчик = ДанныеЗаполнения.Инициатор;
	Исполнитель = ДанныеЗаполнения.Ответственный;
	Конфигурация = ДанныеЗаполнения.Конфигурация;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Движения.ИзмененияКонфигурации.Записывать = Истина;
	Для Каждого ТекСтрокаИзменения Из Изменения Цикл
		Движение = Движения.ИзмененияКонфигурации.Добавить();
		Движение.Период = Дата;
		Движение.Заказчик = Заказчик;
		Движение.Исполнитель = Исполнитель;
		Движение.Конфигурация = Конфигурация;
		Движение.ДокументОснование = ДокументОснование;
		Движение.Состояние = Состояние;
		Движение.ОсновнойРелиз = Релиз;
		Движение.Версия = ТекСтрокаИзменения.Версия;
		Движение.ГруппаМетаданных = ТекСтрокаИзменения.ГруппаМетаданных;
		Движение.ОбъектМетаданных = ТекСтрокаИзменения.ОбъектМетаданных;
		Движение.Релиз = ТекСтрокаИзменения.Релиз;
		Движение.НомерСтрокиТЧ = ТекСтрокаИзменения.НомерСтроки;
		Движение.ПовышенныйРиск = ПовышенныйРиск;
	КонецЦикла;
КонецПроцедуры
